#### Terraform Plan 📖 (exit 2)
```hcl
data.aws_iam_policy_document.sfn_assume: Reading...
data.aws_partition.current: Reading...
data.aws_iam_policy_document.sfn_assume: Read complete after 0s [id=4022981484]
data.aws_iam_policy_document.glue_assume: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.glue_assume: Read complete after 0s [id=2681768870]
data.aws_ami.windows: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=916740064153]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
data.aws_ami.windows: Read complete after 1s [id=ami-06f5f29d1fe41ea03]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.glue_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "S3Access"
        }
      + statement {
          + actions   = [
              + "glue:BatchCreatePartition",
              + "glue:BatchDeletePartition",
              + "glue:BatchUpdatePartition",
              + "glue:CreateDatabase",
              + "glue:CreateTable",
              + "glue:GetConnection",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTables",
              + "glue:UpdateTable",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GlueCatalogAccess"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchLogs"
        }
      + statement {
          + actions   = [
              + "glue:GetConnection",
              + "glue:GetConnections",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "GlueConnection"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "SecretsManager"
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatch"
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:CreateTags",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DeleteTags",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeRouteTables",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeVpcEndpoints",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "EC2"
        }
    }

  # data.aws_iam_policy_document.sfn_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sfn_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:BatchStopJobRun",
              + "glue:GetJob",
              + "glue:GetJobRun",
              + "glue:GetJobRuns",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTables",
              + "glue:StartJobRun",
              + "glue:UpdateTable",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GlueStartJobRun"
        }
      + statement {
          + actions   = [
              + "glue:GetCrawler",
              + "glue:StartCrawler",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "GlueCrawler"
        }
    }

  # data.aws_iam_policy_document.sns_allow_eventbridge_publish will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_allow_eventbridge_publish" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowEventBridgePublish"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_secretsmanager_secret_version.rds_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret_version" "rds_password" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + region         = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = "olistflow-etl-dev-rds-master-password"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_cloudwatch_event_rule.glue_job_failed will be created
  + resource "aws_cloudwatch_event_rule" "glue_job_failed" {
      + arn            = (known after apply)
      + description    = "Alert on olistflow-etl-dev Glue job failures/timeouts/stops"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + jobName = [
                      + "olistflow_etl_dev_raw_to_curated",
                      + "olistflow_etl_dev_curated_to_rds",
                    ]
                  + state   = [
                      + "FAILED",
                      + "TIMEOUT",
                      + "STOPPED",
                    ]
                }
              + detail-type = [
                  + "Glue Job State Change",
                ]
              + source      = [
                  + "aws.glue",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "olistflow-etl-dev-glue-job-failed"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.glue_job_failed_to_sns will be created
  + resource "aws_cloudwatch_event_target" "glue_job_failed_to_sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + rule           = "olistflow-etl-dev-glue-job-failed"
      + target_id      = "SendToSNS"
    }

  # aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "olistflow-etl-dev"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "olistflow-etl-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "us-east-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "olistflow-etl-dev"
      + name_prefix             = (known after apply)
      + region                  = "us-east-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
    }

  # aws_glue_catalog_database.curated will be created
  + resource "aws_glue_catalog_database" "curated" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "olistflow_etl_curated"
      + region       = "us-east-1"
      + tags         = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
    }

  # aws_glue_catalog_database.raw will be created
  + resource "aws_glue_catalog_database" "raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "olistflow_etl_raw"
      + region       = "us-east-1"
      + tags         = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
    }

  # aws_glue_classifier.csv_olist will be created
  + resource "aws_glue_classifier" "csv_olist" {
      + id     = (known after apply)
      + name   = "olistflow_etl_dev_csv_classifier"
      + region = "us-east-1"

      + csv_classifier {
          + contains_header        = "PRESENT"
          + delimiter              = ","
          + disable_value_trimming = false
          + quote_symbol           = "\""
          + serde                  = (known after apply)
        }
    }

  # aws_glue_connection.rds will be created
  + resource "aws_glue_connection" "rds" {
      + arn                   = (known after apply)
      + catalog_id            = (known after apply)
      + connection_properties = (sensitive value)
      + connection_type       = "JDBC"
      + id                    = (known after apply)
      + name                  = "olistflow_etl_dev_rds_jdbc"
      + region                = "us-east-1"
      + tags_all              = (known after apply)

      + physical_connection_requirements {
          + availability_zone      = "us-east-1a"
          + security_group_id_list = (known after apply)
          + subnet_id              = (known after apply)
        }
    }

  # aws_glue_crawler.raw will be created
  + resource "aws_glue_crawler" "raw" {
      + arn           = (known after apply)
      + classifiers   = (known after apply)
      + database_name = "olistflow_etl_raw"
      + id            = (known after apply)
      + name          = "olistflow_etl_dev_raw_crawler"
      + region        = "us-east-1"
      + role          = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }

      + s3_target {
          + path = "s3://olistflow-etl-dev-raw/olist/"
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # aws_glue_job.curated_to_rds will be created
  + resource "aws_glue_job" "curated_to_rds" {
      + arn               = (known after apply)
      + connections       = [
          + "olistflow_etl_dev_rds_jdbc",
        ]
      + default_arguments = {
          + "--CURATED_BUCKET"                   = "olistflow-etl-dev-curated"
          + "--CURATED_DB"                       = "olistflow_etl_curated"
          + "--CURATED_PREFIX"                   = "olist/"
          + "--JDBC_CONNECTION_NAME"             = "olistflow_etl_dev_rds_jdbc"
          + "--RAW_DB"                           = "olistflow_etl_raw"
          + "--additional-python-modules"        = "psycopg2-binary==2.9.11,boto3==1.42.33"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-metrics"                   = ""
          + "--job-language"                     = "python"
        }
      + glue_version      = "4.0"
      + id                = (known after apply)
      + job_mode          = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "olistflow_etl_dev_curated_to_rds"
      + number_of_workers = 2
      + region            = "us-east-1"
      + role_arn          = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + timeout           = 30
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://olistflow-etl-dev-artifacts/glue/jobs/curated_to_rds.py"
        }
    }

  # aws_glue_job.raw_to_curated will be created
  + resource "aws_glue_job" "raw_to_curated" {
      + arn               = (known after apply)
      + connections       = [
          + "olistflow_etl_dev_rds_jdbc",
        ]
      + default_arguments = {
          + "--CURATED_BUCKET"                   = "olistflow-etl-dev-curated"
          + "--CURATED_DB"                       = "olistflow_etl_curated"
          + "--CURATED_PREFIX"                   = "olist/"
          + "--RAW_BUCKET"                       = "olistflow-etl-dev-raw"
          + "--RAW_DB"                           = "olistflow_etl_raw"
          + "--RAW_PREFIX"                       = "olist/"
          + "--additional-python-modules"        = "awswrangler==3.14.0,numpy<2,pyarrow==14"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-metrics"                   = ""
          + "--job-language"                     = "python"
        }
      + glue_version      = "4.0"
      + id                = (known after apply)
      + job_mode          = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "olistflow_etl_dev_raw_to_curated"
      + number_of_workers = 2
      + region            = "us-east-1"
      + role_arn          = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + timeout           = 30
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://olistflow-etl-dev-artifacts/glue/jobs/raw_to_curated.py"
        }
    }

  # aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "olistflow-etl-dev-bastion-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "olistflow-etl-dev-bastion-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "olistflow-etl-dev-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.glue_role will be created
  + resource "aws_iam_role" "glue_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "olistflow-etl-dev-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.sfn_role will be created
  + resource "aws_iam_role" "sfn_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "olistflow-etl-dev-sfn-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.glue_inline will be created
  + resource "aws_iam_role_policy" "glue_inline" {
      + id          = (known after apply)
      + name        = "olistflow-etl-dev-glue-inline"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.sfn_inline will be created
  + resource "aws_iam_role_policy" "sfn_inline" {
      + id          = (known after apply)
      + name        = "olistflow-etl-dev-sfn-inline"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.bastion_s3_readonly will be created
  + resource "aws_iam_role_policy_attachment" "bastion_s3_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "olistflow-etl-dev-bastion-role"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-06f5f29d1fe41ea03"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "olistflow-etl-dev-bastion-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "olistflow-etl-dev-bastion-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "windows-bastion-rds"
        }
      + tags_all                             = {
          + "Name" = "windows-bastion-rds"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            # Run as System on startup
            <powershell>
            $ErrorActionPreference = 'Stop'
            
            $serversJson = 'C:\pgadmin\servers.json'
            
            # Log everything
            $LogDir = 'C:\ProgramData\userdata'
            New-Item -ItemType Directory -Path $LogDir -Force | Out-Null
            Start-Transcript -Path '$LogDir\userdata.log' -Append
            
            try {
                # Ensure folders exist
                New-Item -ItemType Directory -Path 'C:\pgadmin\scripts\sql' -Force | Out-Null
            
                # Enable RDP
                Set-ItemProperty -Path 'HKLM:\System\CurrentControlSet\Control\Terminal Server' -Name 'fDenyTSConnections' -Value 0
                Enable-NetFirewallRule -DisplayGroup 'Remote Desktop'
            
                # Install Chocolatey
                Set-ExecutionPolicy Bypass -Scope Process -Force
                [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.SecurityProtocolType]::Tls12
                iex ((New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1'))
            
                # Install pgAdmin4
                choco install pgadmin4 -y
            
                # Install AWS Tools for PowerShell if missing, then import
                if (-not (Get-Module -ListAvailable -Name AWSPowerShell)) {
                    Install-PackageProvider -Name NuGet -MinimumVersion 2.8.5.201 -Force
                    Install-Module -Name AWSPowerShell -Force -AllowClobber
                }
                Import-Module AWSPowerShell
            
                # Set default region explicitly (needed for AWS cmdlets to pick endpoints)
                Set-DefaultAWSRegion -Region 'us-east-1'
            
                # Download artifacts from S3
                Read-S3Object -BucketName 'olistflow-etl-dev-artifacts' -Key 'pgadmin/servers.json'  -File $serversJson
                Read-S3Object -BucketName 'olistflow-etl-dev-artifacts' -Key 'scripts/sql/init.sql' -File 'C:\pgadmin\scripts\sql\init.sql'
            
                # Setup DB
                $pgRoot    = Join-Path $env:ProgramFiles 'pgAdmin 4'
                $pythonExe = Join-Path $pgRoot 'python\python.exe'
                $setupPy   = Join-Path $pgRoot 'web\setup.py'
            
                & $pythonExe $setupPy setup-db
            
                # Import server
                & $pythonExe $setupPy load-servers $serversJson --sqlite-path $sqlitePath --replace
            
                'Success: $(Get-Date -Format o)' | Out-File '$LogDir\status.txt' -Append
            }
            catch {
                'Failure: $(Get-Date -Format o)`r`n$($_ | Out-String)' | Out-File '$LogDir\status.txt' -Append
                throw
            }
            finally {
                Stop-Transcript
            }
            </powershell>
            <persist>true</persist>
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.bastion will be created
  + resource "aws_key_pair" "bastion" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "olistflow-etl-dev-bastion-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + region          = "us-east-1"
      + tags_all        = (known after apply)
    }

  # aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                             = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-rtb"
          + "Project"     = "olistflow-etl"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-rtb"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public"
          + "Project"     = "olistflow-etl"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.artifacts will be created
  + resource "aws_s3_bucket" "artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "olistflow-etl-dev-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.curated will be created
  + resource "aws_s3_bucket" "curated" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "olistflow-etl-dev-curated"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.raw will be created
  + resource "aws_s3_bucket" "raw" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "olistflow-etl-dev-raw"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_server_side_encryption_configuration.artifacts will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.curated will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "curated" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.raw will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "raw" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.artifacts will be created
  + resource "aws_s3_bucket_versioning" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.curated will be created
  + resource "aws_s3_bucket_versioning" "curated" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.raw will be created
  + resource "aws_s3_bucket_versioning" "raw" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_object.add_glue_jobs_files["curated_to_rds.py"] will be created
  + resource "aws_s3_object" "add_glue_jobs_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "glue/jobs/curated_to_rds.py"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../glue/jobs/curated_to_rds.py"
      + source_hash            = "ca35f9a7caf17dbfe48a929e93c9a1e4"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_glue_jobs_files["raw_to_curated.py"] will be created
  + resource "aws_s3_object" "add_glue_jobs_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "glue/jobs/raw_to_curated.py"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../glue/jobs/raw_to_curated.py"
      + source_hash            = "f7e0232b3781489694d8b3ff75db045a"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_pgadmin_servers_connection_details will be created
  + resource "aws_s3_object" "add_pgadmin_servers_connection_details" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = (known after apply)
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "pgadmin/servers.json"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_customers_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_customers_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_customers_dataset.csv"
      + source_hash            = "8a2c4244856aab4bde3b8ed81f8ca251"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_order_items_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_order_items_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_order_items_dataset.csv"
      + source_hash            = "f4fa76976662e9cba0633f9e49ed2645"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_order_payments_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_order_payments_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_order_payments_dataset.csv"
      + source_hash            = "75ce0c041d18e5f250c5cea9a8042944"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_order_reviews_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_order_reviews_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_order_reviews_dataset.csv"
      + source_hash            = "7d582531e5ed47538bc4b166c61f911d"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_orders_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_orders_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_orders_dataset.csv"
      + source_hash            = "8bd60e55c1ca229d9f70b62f3e72f22c"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_products_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_products_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_products_dataset.csv"
      + source_hash            = "e935401104a3669223b83c9a01fdf5ca"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_raw_files["olist_sellers_dataset.csv"] will be created
  + resource "aws_s3_object" "add_raw_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "olist/olist_sellers_dataset.csv"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../data/olist/olist_sellers_dataset.csv"
      + source_hash            = "5b22c02facdf842d6c0aea36e1849018"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.add_sql_script["init.sql"] will be created
  + resource "aws_s3_object" "add_sql_script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/sql/init.sql"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "./../scripts/sql/init.sql"
      + source_hash            = "b930d8a8f5c9971942dc0c970b621630"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + version_id             = (known after apply)
    }

  # aws_secretsmanager_secret.bastion_keypair will be created
  + resource "aws_secretsmanager_secret" "bastion_keypair" {
      + arn                            = (known after apply)
      + description                    = "SSH key pair for bastion host (private + public)"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "olistflow-etl-dev-bastion-keypair"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "us-east-1"
      + tags                           = {
          + "Name" = "bastion-keypair"
        }
      + tags_all                       = {
          + "Name" = "bastion-keypair"
        }
    }

  # aws_secretsmanager_secret.rds_password will be created
  + resource "aws_secretsmanager_secret" "rds_password" {
      + arn                            = (known after apply)
      + description                    = "Master password for olist-etl RDS instance"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "olistflow-etl-dev-rds-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "us-east-1"
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.bastion_keypair will be created
  + resource "aws_secretsmanager_secret_version" "bastion_keypair" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_secretsmanager_secret_version.rds_password_version will be created
  + resource "aws_secretsmanager_secret_version" "rds_password_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "bastion-windows-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Allow Glue/RDS access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Glue to RDS PostgreSQL"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "Glue/Spark intra-cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = "olistflow-etl-dev-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.rds_access will be created
  + resource "aws_security_group_rule" "rds_access" {
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_sfn_state_machine.etl will be created
  + resource "aws_sfn_state_machine" "etl" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "OlistFlow ETL: crawl raw -> raw_to_curated -> curated_to_rds"
              + StartAt = "StartRawCrawler"
              + States  = {
                  + "CrawlerDone?"  = {
                      + Choices = [
                          + {
                              + Next         = "RunRawToCurated"
                              + StringEquals = "READY"
                              + Variable     = "$.Crawler.State"
                            },
                        ]
                      + Default = "WaitForCrawler"
                      + Type    = "Choice"
                    }
                  + GetCrawler      = {
                      + Next       = "CrawlerDone?"
                      + Parameters = {
                          + Name = "olistflow_etl_dev_raw_crawler"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:glue:getCrawler"
                      + Type       = "Task"
                    }
                  + RunCuratedToRds = {
                      + End        = true
                      + Parameters = {
                          + JobName = "olistflow_etl_dev_curated_to_rds"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + RunRawToCurated = {
                      + Next       = "RunCuratedToRds"
                      + Parameters = {
                          + JobName = "olistflow_etl_dev_raw_to_curated"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + StartRawCrawler = {
                      + Next       = "WaitForCrawler"
                      + Parameters = {
                          + Name = "olistflow_etl_dev_raw_crawler"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:glue:startCrawler"
                      + Type       = "Task"
                    }
                  + WaitForCrawler  = {
                      + Next    = "GetCrawler"
                      + Seconds = 30
                      + Type    = "Wait"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "olistflow-etl-dev-orchestrator"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "us-east-1"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Project"     = "olistflow-etl"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # aws_sns_topic.glue_alerts will be created
  + resource "aws_sns_topic" "glue_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "olistflow-etl-dev-glue-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.glue_alerts_policy will be created
  + resource "aws_sns_topic_policy" "glue_alerts_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # aws_sns_topic_subscription.glue_alerts_email will be created
  + resource "aws_sns_topic_subscription" "glue_alerts_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "temi.oluseun@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-1"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-1"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-2"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-private-2"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public-1"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public-1"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public-2"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-public-2"
          + "Project"     = "olistflow-etl"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev"
          + "Project"     = "olistflow-etl"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev"
          + "Project"     = "olistflow-etl"
        }
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + auto_accept           = true
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "us-east-1"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-s3-endpoint"
          + "Project"     = "olistflow-etl"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "olistflow-etl-dev-s3-endpoint"
          + "Project"     = "olistflow-etl"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # local_file.pgadmin_servers will be created
  + resource "local_file" "pgadmin_servers" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./artifacts/servers.json"
      + id                   = (known after apply)
    }

  # random_password.rds_password will be created
  + resource "random_password" "rds_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # tls_private_key.bastion will be created
  + resource "tls_private_key" "bastion" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 69 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifacts_bucket  = "olistflow-etl-dev-artifacts"
  + bastion_public_ip = (known after apply)
  + curated_bucket    = "olistflow-etl-dev-curated"
  + glue_curated_db   = "olistflow_etl_curated"
  + glue_raw_db       = "olistflow_etl_raw"
  + raw_bucket        = "olistflow-etl-dev-raw"
  + rds_endpoint      = (known after apply)
  + secret_arn        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```